[Survived] ConditionalExpression
src/lib/http.ts:85:7
   const contentType = res.headers.get("content-type") || "";
   const text = await res.text();
   let parsed: any = null;
-  if (text) {
+  if (true) {
     try {
       parsed = contentType.includes("application/json")
